# GetTypeN

## Description
Returns the type index of the referenced planar or screen object.&lt;BR&gt;
&lt;BR&gt;
A complete listing of supported object types may be found in the &lt;A HREF=&quot;../Appendix/appendix.html#objects&quot;&gt;Appendix&lt;/A&gt;.
&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetTypeN(h : HANDLE) : INTEGER;
```

```python

def vs.GetTypeN(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## See Also
VS Functions:
GetType

## Version
Availability: from Vectorworks 2011
## Category
* Object Info